Repository: seanpm2001/mt-training-data
Catalog: st/st_pontoon.tmx
Source language: en_us
Languages: st

source: 2019 End-of-Year Release
st: Phatlalatso ya Qetello ya Selemo ya 2019

source: 2 down, keep it up!<playIcon></playIcon>
st: 2 fatshe, pele ya pele!<playIcon></playIcon>

source: ≥ 2 No votes
st: ≥ 2 Ha ho dikgetho

source: ≥ 2 Yes votes
st: ≥ 2 Dikgetho tsa E

source: Abbreviations and Acronyms. Abbreviations and acronyms like “USA” or “ICE” should be avoided in the source text because they may be read in a way that does not coincide with their spelling. Additionally, there may be multiple accurate readings for a single abbreviation. For example, the acronym “ICE” could be pronounced “I-C-E” or as a single word.
st: Dikgutsufatso le mantswe a kgutsufaditsweng. Dikgutsufatso le mantswe a kgutsufaditsweng tse kang "USA" kapa "ICE" di lokela ho qojwa sengolweng-sa-mathomo hobane di ka balwa ka tsela e sa dumellaneng le mopeleto wa tsona. Ho feta moo, ho ka ba le mekgwa ya ho bala e mengata e nepahetseng bakeng sa kgutsufatso e le nngwe. Mohlala, kgutsufatso ya lentswe "ICE" e ka bitswa "I-C-E" kapa e le lentswe le le leng.

source: About
st: Ka

source: Accent
st: Pitso ya mantswe

source: Account
st: Ak'haonte

source: <accuracyLink>See more on accuracy criteria.</accuracyLink>
st: <accuracyLink>Sheba haholwanyane ka mokgwa wa nepahalo.</accuracyLink>

source: { $actionType }<playIcon></playIcon> did they accurately speak the sentence?
st: { $actionType }<playIcon></playIcon> na ba buile polelo eo ka nepo?

source: { $actionType }<recordIcon></recordIcon> then read the sentence aloud
st: { $actionType } <recordIcon></recordIcon> ebe o bala polelo eo o hweleditse

source: { $actionType }<stopIcon></stopIcon> when done
st: { $actionType }<stopIcon></stopIcon> ha o qetile

source: { $actionType } submit when ready
st: { $actionType } romela ha e se e loketse

source: Add
st: Eketsa

source: Add a language you want to contribute to
st: Kenya puo eo o batlang ho kenya letsoho ho yona

source: Add as much information as you can about the language. This could include:
st: Eketsa dintlha tse ngata kamoo o ka kgonang ka puo. Sena se ka kenyelletsa:

source: Adding languages to work with
st: Ho kenya dipuo tse tlo sebetswa

source: Additional Language
st: Puo ya tlatsetso

source: Add Language
st: Kenya Puo

source: <addLink>Add more sentences now!</addLink>
st: addLink>Kenya dipolelo tse ding hona jwale!</addLink>

source: Add new custom accent "{ $inputValue }"
st: Kenya mokgwa wa ho bua o motjha o etseditsweng wena"{ $inputValue }"

source: Add new sentences
st: Kenya dipolelo tse ntjha

source: Add Sentences
st: Kenya Dipolelo

source: Add <wikipediaLink>public domain</wikipediaLink> sentences
st: Kenya <wikipediaLink>setjhabeng </wikipediaLink> dipolelo

source: Add Your Voice
st: Kenya Lentswe la hao

source: A few bytes
st: Di-byte tse mmalwa

source: Age
st: Dilemo

source: All
st: Koafela

source: All sentences you submit must be under <wikipediaLink>Public Domain (CC-0) license</wikipediaLink>. To support the inclusion of work not under public licence, we have created a <cc0WaiverLink>Contributions Agreement template</cc0WaiverLink> for works where the copyright owner would like to contribute the material to Common Voice.
st: Dipolelo tsohle tseo o di romelletseng di tlameha ho ba tlasa <wikipediaLink>laecence ya Setjhaba (CC-0)</wikipediaLink>. Ho tshehetsa ho kenyelletsa ha mosebetsi o seng tlasa laesense ya setjhaba, re entse</cc0WaiverLink>mohlala wa Tumellano ya Menehelo<cc0WaiverLink>bakeng sa mesebetsi moo monga ditokelo tsa sengolwa a ka ratang ho tlatsetsa ka thepa ho Common Voice.

source: All voice clips in the dataset are scrubbed of personally identifying information. When a contributor provides demographic data via their profile, that information is de-identified from their voice clips before being bundled for download in the dataset and is never made public on their profile page.
st: Kaofela dikotwana tsa mantswe tse ka hara pokello ya data di hlwekiswa ho tlosa dintlha tsa botho. Ha mofani a fana ka data ya palo ya batho ka profaele ya hae, dintlha tseo di hlwekiswa ho tlosa dintlha tsa botho pele di kopanngwa mmoho bakeng sa download ka ho pokello ya data mme ha di na ho phatlalatswa leqepheng la profaele la bona.

source: Anonymized user data like age, gender, and accent helps improve the audio data used to train the accuracy of speech recognition engines. Your username and email will never be associated with your submitted data, and you can choose whether to make your username public or anonymous.
st: Dintlha tsa mosebedisi tse sa tsebahaleng jwaloka dilemo, bong, le tsela ya puo di thusa ho ntlafatsa data ya audio e sebediswang ho kwetlisa nepahalo ya dienjene tse elellwang puo. Lebitso la mosebedisi la hao le imeile di ke ke tsa amahangwa le dintlha tse romelletsweng ya hao, mme o ka kgetha na o etsa lebitso la mosebedisi la hao le be phatlalatsa kapa le se ke la tsebahala.

source: Approve
st: Amohela

source: A quiet background hubbub is OK, but we don’t want additional voices that may cause a machine algorithm to identify words that are not in the written text. If you can hear distinct words apart from those of the text, the clip should be rejected. Typically this happens where the TV has been left on, or where there is a conversation going on nearby.
st: Lerata le tlase le kamorao le nepahetse, empa ha re batle mantswe a mang a ka etsang hore algorithm ya motjhini e tsebe mantswe a sa ngolwang sengolweng. Haeba o utlwa mantswe a kgethehileng ntle le ho a sengolweng, sekotwana se tlameha ho hanwa. Ka tlwaelo hona ho etsahala moo TV e siilweng e butswe, kapa moo ho nang le moqoqo o ntseng o tswelapele haufi.

source: Are you coming? <strong>[called by another]</strong>
st: O wa tla? <strong>[o bitswa ke e mong]</strong>

source: Armenian Western
st: Armenian ya Bophirimela

source: Ask about a new language
st: Botsa ka puo e ntjha

source: Audio Format
st: Sebopeho sa audio

source: Avatar uploaded
st: Avatar e kentswe

source: Average
st: E bohareng

source: A voice clip is marked "valid" when a user gives it a Yes vote.
st: Clip ya lentswe e tshwauwa "e nepahetse" ha mosebedisi a e fa kgetho ya Ee.

source: Avoid too much background noise - it should be easy to hear you.
st: Qoba lerata la kamorao le lengata haholo - ho lokela ho ba bonolo ho o utlwa.

source: Awards
st: Dikgau

source: Back
st: Morao

source: Background Noise
st: Lerata le ka morao

source: Background Voices
st: Mantswe a ka morao

source: Back to Top
st: Kgutlela Hodimo

source: Be cautious before rejecting a clip on the ground that the reader has mispronounced a word, has put the stress in the wrong place, or has apparently ignored a question mark. There are a wide variety of pronunciations in use around the world, some of which you may not have heard in your local community. Please provide a margin of appreciation for those who may speak differently from you.
st: Eba hlokolosi pele o hana sekotwana ka lebaka la hore mmadi ha bitsa lentswe hantle, o behile kgatello ya maikutlo sebakeng se fosahetseng, kapa ho bonahala a iphapanyeditse letswaho-potso. Hona le ditsela tse fapaneng tsa ho bitsa mantswe tse sebediswang lefatshe ka bophara, tse ding tseo o ka tswang o so di utlwe setjhabeng sa heno. Ka kopo fana ka moedi wa kananelo ho ba ka buang ka mokgwa o fapaneng le wa hao.

source: Benefits
st: Melemo

source: [‘Beret’ is OK whether with stress on the first syllable (UK) or the second (US)]
st: ['Beret' e lokile ebang ke ka kgatello ya lentswe la pele (UK) kapa la bobeli (US)]

source: <bold>{ $count }</bold> Clips
st: <bold>{ $count }</bold> Di-Clip

source: <bold>Help us</bold> find more voices
st: <bold>Re thuse</bold> ho fumana mantswe a mang

source: Both
st: Bobedi

source: Both (Speak and Listen)
st: Ka bobedi (Bua le ho Mamela)

source: Browse Languages
st: Sheba Dipuo

source: Build a custom goal
st: Aha sepheo se etseditsweng wena feela

source: Build Profile
st: Haha Profaele

source: <b>Why an email?</b> We may need to contact you in the future about changes to the dataset, an email provides us a point of contact.
st: <b>Hobaneng imeile?<b> Re ka hloka ho ikopanya le oena ka moso ka diphetoho tse ho pokello ya data, imeile e re fa mokgwa wa ho ikopanya le wena.

source: By editing your goal, you may lose your existing progress.
st: Ka ho hlophisa sepheo sa hao, o ka lahlehelwa ke tswelopele ya hao e teng.

source: By opting in to receive emails you state that you are okay with Mozilla handling this info as explained in Mozilla’s <privacyLink>Privacy Policy</privacyLink>.
st: Ha o kgetha ho amohela di-email o bolela hore ha o na bothata ha Mozilla e sebetsana le dintlha tsena jwalo kaha ho hlalositswe ho Mozilla <privacyLink>Leano la Lekunutu</privacyLink>.

source: <b>You agree</b> to not attempt to determine the identity of speakers in the Common Voice dataset
st: <b> O dumela<b> ho se leke ho fumana boitsebiso ba dibui tse ka ho pokello ya data ya Common Voice.

source: By providing some information about yourself, the audio data you submit to Common Voice will be more useful to Speech Recognition engines that use this data to improve their accuracy.
st: Ka ho fana ka dintlha tse ding ka wena, data ya audio yeo o e romellang ho Common Voice e tla ba molemo haholo ho dienjene tsa Temoho ya Puo tse sebedisang data ena ho ntlafatsa nepahalo ya tsona.

source: By using Common Voice, you agree to our <termsLink>Terms</termsLink> and <privacyLink>Privacy Notice</privacyLink>
st: Ka ho sebedisa Common Voice, o dumellana le <termsLink>Dipehelo</termsLink> le <privacyLink>Tsebiso ya Lekunutu</privacyLink>

source: Cancel Re-recording
st: Hlakola ho rekota hape

source: Cancel Submission
st: Hlakola ho Romela

source: Can't decide?
st: Ha o kgone ho etsa qeto?

source: Change your email via Settings under Login Identity
st: Fetola imeile ya hao ka Ditlhophiso tlasa Boitsebiso ba ho Kena

source: Check if your language is listed on the <languagesPageLink>Common Voice Languages page</languagesPageLink>. If not, fill out this form and we’ll <strong>send you a handy email explaining how to get your language set up</strong>.
st: Sheba na puo ya hao e thathahamisitswe ho <languagesPageLink>leqephe la Dipuo la Common Voice</languagesPageLink>. Haeba ho se jwalo, tlatsa foromo ena mme re tla <strong> o romella imeile e molemo e hlalosang hore na o ka theha puo ya hao jwang</strong>.

source: <chevron></chevron>See less
st: <chevron></chevron>Bona hanyane

source: <chevron></chevron>See more
st: <chevron></chevron>Bona tse ding

source: Choose language/localization
st: kgetha puo/localization

source: Click
st: Penya

source: { $clipCount } voice clips, total archive size { $size }. Expires { $expires }.
st: { $clipCount } di-clip tsa mantswe, ka kakaretso di lekane { $size }. E fellwa ke nako { $expires }.

source: Clip Graveyard
st: Di-clip tsa Mabitleng

source: Clips recorded
st: Di-clip di rekotilwe

source: Clips Uploaded
st: Di-clip di kentswe

source: Clips validated
st: Di-clip di netefaditswe

source: Clips You've Recorded
st: Di-clip tseo O di Rekotileng

source: Clips You've Validated
st: Di-clip tseo O di Netefaditseng

source: Close
st: Kwala

source: Collecting sentences
st: Ho bokella dipolelo

source: Collecting sentences from the public domain, or writing new ones for the public domain.
st: Ho bokella dipolelo ho tswa sebakeng sa setjhaba, kapa ho ngola tse ntjha bakeng sa phatlalatso ya setjhaba.

source: Collect sentences
st: Bokella dipolelo

source: Comment
st: Hlahisa Maikutlo

source: Common Voice data plus all other voice datasets above.
st: Data ya Common Voice le dipokello tsa data ding kaofela tse ka hodimo.

source: Common Voice Dataset
st: Pokello ya Data ya Common Voice

source: Common Voice is a crowdsourcing platform, and the languages were all added by volunteers. We would love for you to add your language! <languageRequestLink>Ask about adding your language.</languageRequestLink>
st: Common Voice ke sethala sa batho ba bangata, mme dipuo kaofela di kentswe ke baithaopi. Re ka rata hore o kenye puo ya hao!<languageRequestLink>Botsa ka ho kenya puo ya hao</languageRequestLink>

source: Common Voice is Mozilla's initiative to help teach machines how real people speak.
st: Common Voice ke mohato wa Mozilla wa ho thusa ho ruta metjhini hore na batho ba nnete ba bua jwang.

source: Common Voice is part of Mozilla's initiative to help teach machines how real people speak.
st: Common Voice ke karolo ya boikitlaetso ba Mozilla ba ho thusa ho ruta metjhini hore na batho ba nnete ba bua jwang.

source: Common Voice is the world’s largest publicly available, multi-language voice dataset.
st: Common Voice ke pokello ya data ya mantswe e kgolo ka ho fetisisa lefatsheng e fumanehang phatlalatsa, e nang le dipuo tse ngata.

source: Common Voice recordings are used by academics, small businesses, and voice recognition enthusiasts to help train and grow publicly available resources like voice models. Can you let us know why you would like your recordings deleted?
st: Direkoto tsa Common Voice Di sebediswa ke barutehi, dikhoebo tse nyane, le batho ba chesehelang ho tseba mantswe ho thusa ho kwetlisa le ho hodisa disebediswa tse fumanehang phatlalatsa joaloka mefuta ya mantswe. A na o ka re tsebisa hore na ke hobaneng ha o batla hore direkoto tsa hao di hlakolwe?

source: Community participation and decision making.
st: Ho kenya letsoho ha setjhaba le ho etsa diqeto.

source: Community Playbook
st: Buka ya ho bapala ya setjhaba

source: Confirm
st: Netefatsa

source: Confirm Goal
st: Netefatsa sepheo

source: Confirm New Sentences
st: Netefatsa Dipolelo tse Ntjha

source: Connect with Gravatar
st: Kopana le Gravatar

source: Contact
st: Tshwara

source: Contact Form
st: Foromo ya ho ikopanya

source: Content available under a <licenseLink>Creative Commons license</licenseLink>
st: Ditaba di fumaneha tlasa <licenseLink>laesense ya Creative Commons</licenseLink>

source: Continue
st: Tswela pele

source: Contribute
st: Kenya letsoho

source: Contribute sentences
st: Nehelana ka dipolelo

source: Contribute to { $lang }
st: Kenya letsoho ho { $lang }

source: Contribute Your Voice
st: Fana ka Lentswe la Hao

source: Contribution Activity
st: Mosebetsi wa Monehelo

source: Contribution Criteria
st: Mekgwa ya ho Nehelana

source: Contribution Experience
st: Boiphihlelo ba Monehelo

source: Contributors record voice clips by reading from a bank of donated sentences.
st: Batshehetsi ba rekota di-clip tsa mantswe ka ho bala ho tswa bankeng ya dipolelo tse fanweng.

source: Cookies
st: Di-cookie

source: <coquiLink>Coqui</coquiLink> is dedicated to open speech technology. Their projects include deep learning based STT and TTS engines.
st: <coquiLink>Coqui</coquiLink> e inehetse ho thekenoloji ya puo e bulehileng. Merero ya bona e kenyelletsa boithuto bo tebileng bo thehilweng ho enjene tsa STT le TTS.

source: Could not add language
st: Ha e ya kgona ho kenya puo

source: Could not change settings. Please try again.
st: Ha e kgone ho fetola ditlhophiso. Ka kopo leka hape.

source: Could not remove language
st: Ha e ya kgona ho tlosa puo

source: Could not remove language: language not found
st: Ha e kgone ho tlosa puo: puo ha e fumanehe

source: { $count } clips
st: { $count } di-clip

source: { $count }mo
st: { $count } dikgwedi

source: { $countOfInvalidated } rejected by you
st: { $countOfInvalidated } e hannweng ke wena

source: { $countOfReviewed } sentences are already reviewed. Great job!
st: { $countOfReviewed } dipolelo di se di hlahlobilwe. Mosebetsi o motle!

source: { $countOfSentences } sentences found.
st: { $countOfSentences } dipolelo di fumanwe.

source: { $countOfUnreviewed } sentences are unreviewed. If you want, you can also review your sentences now before submitting them.
st: { $countOfUnreviewed } ya dipolelo ha ya hlahlojwa. Haeba o batla, o ka boela wa hlahloba dipolelo tsa hao hona jwale pele o di romela.

source: { $count }wk
st: { $count }beke

source: { $count }y
st: { $count } dilemo

source: Create a Custom Goal
st: Etsa sepheo se etseditsweng wena feela

source: Creating opportunities for a diversity of people to contribute to Common Voice ensures the dataset serves as many people as possible. We’ve created resources and templates that you can use!
st: Ho theha menyetla ya hore batho ba fapaneng ba kenye letsoho ho Common Voice ho netefatsa hore pokello ya data e sebeletsa batho ba bangata kamoo ho ka kgonehang. Re entse disebediswa le mehlala eo o ka e sebedisang!

source: Criteria
st: Ditekanyetso

source: Daily Goal
st: Sepheo sa Letsatsi le Letsatsi

source: Dataset Release
st: Tokollo ya Pokello ya Data

source: Datasets
st: Dipokello tsa data

source: Date
st: Letsatsi

source: Days
st: Matsatsi

source: De-identified
st: E tlositsweng dintlha tsa botho

source: Delete my recordings
st: Hlakola direkoto tsa ka

source: Delete Profile
st: Hlakola Profaele

source: Delete selected sentences
st: Hlakola dipolelo tse kgethilweng...

source: Deleting selected sentences…
st: Ho hlakola dipolelo tse kgethilweng...

source: Different language
st: Puo e fapaneng

source: Difficult
st: E thata

source: Difficult to pronounce
st: Ho thata ho bitsa

source: Discard ongoing recording
st: Lahla rekoto entse tswelapele

source: Donate your voice
st: Nehelana ka lentswe la hao

source: Don't see your language on Common Voice yet?
st: Na ha o so bone puo ya hao ho Common Voice?

source: Don’t see your language reflected in the Dataset? To request a language head over to our Languages page.
st: Ha o bone puo ya hao e hlaha ho Dataset? Ho kopa puo eya ho leqephe la rona la Dipuo.

source: Download Common Voice Data
st: Download-a Data ya Common Voice

source: Download Data
st: Download-a Data

source: Download Dataset Bundle
st: Download-a Sephuthelwana sa Polokelo ya Data

source: Download { $language }
st: Download-a { $language }

source: Download Links
st: Download-a dihokahanyo

source: Download My Data
st: Download-a Data ya Ka

source: Download profile data
st: Download-a data ya profaele

source: Download the Single Word Target Segment
st: Daonlouda karolo e lebisitsweng ya lentswe le le leng

source: Do you have ideas on how we can make the Common Voice dataset better? Let us know on Discourse
st: O na le maikutlo a hore na re ka etsa jwang hore pokello ya data ya Common Voice e be betere? Re tsebise ho Discourse

source: Do you want to continue?
st: O batla ho tswelapele?

source: Do you want to Speak, Listen or both?
st: Na o batla ho Bua, ho Mamela, kapa di le pedi?

source: Drag and drop or <browseWrap>Browse</browseWrap>
st: Hula mme o dihele kapa <browseWrap>Sheba</browseWrap>

source: During contribution submission feedback will be skipped after clicking 'Submit'. Contribution will continue directly with the next set of 5 recordings or validations.
st: Nakong ya thomello ya tlatsetso maikutlo a tla fetwa kamora ho penya 'Romella'. Tlatsetso e tla tswela pele ka kotloloho ka sete e latelang ya direkoto tse 5 kapa tsa dinetefatso.

source: Each entry in the dataset consists of a unique MP3 and corresponding text file. Many of the <b>{ $total }</b> recorded hours in the dataset also include demographic metadata like age, sex, and accent that can help train the accuracy of speech recognition engines. The dataset currently consists of <b>{ $valid }</b> validated hours in <b>{ $languages }</b> languages, but we’re always adding more voices and languages. Take a look at our <languagesLink>Languages page</languagesLink> to request a language or start contributing.
st: Ntho e nngwe le e nngwe e kentsweng ka hara pokello ya data e na le MP3 e ikgethileng le faele ya sengolwa e tsamaellanang le yona. Bongata ba <b>{ $total }</b> dihora tse rekotilweng kahara pokello ya data di boetse di kenyelletsa metadata ya dintlha tsa palo ya batho jwaloka dilemo, bong le tsela ya puo tse ka thusang ho kwetlisa nepahalo ya dienjene tse elellwang puo. Pokello ya data hajwale e na le <b>{ $valid }</b>dihora tse netefaditsweng ka <b>{ $languages }</b> dipuo, empa re dula re eketsa mantswe le dipuo tse ding. Sheba <languagesLink> Leqephe la Dipuo la rona</languagesLink> ho kopa puo kapa ho qala ho tlatsetsa.

source: Easy
st: E bonolo

source: Edit
st: Lokisa

source: Edit Profile
st: Fetola Profaele

source: Email
st: Imeile

source: <emailFragment>Sign up</emailFragment> to our mailing list to learn how you can take part in campaigns, events and co-design features on Common Voice.
st: <emailFragment>Ingodise</emailFragment> ho lenane la rona la mangolo ho ithuta hore na o ka nka karolo jwang matsholong, diketsahalong le dikarolo tsa moralo o kopanetsweng ho Common Voice.

source: Email is already used for a different account
st: Imeile e se ntse e sebediswa bakeng sa ak'haonte e fapaneng

source: Email Subscriptions
st: Dipeeletso tsa Imeile

source: English
st: Senyesemane

source: Enter Email to Download
st: Kenya Imeile ho Download-a

source: Enter email to send a sign up link
st: Kenya imeile ho romela hokahanyo ya ho ngodisa

source: Enter your email
st: Kenya imeile ya hao.

source: Error { $code }
st: Phoso { $code }

source: Error while fetching rejected sentences. Please try again.
st: Phoso ha re lata dipolelo tsa hao tse hannweng. Ka kopo leka hape.

source: Error while fetching your sentences. Please try again.
st: Phoso ha re lata dipolelo tsa hao. Ka kopo leka hape.

source: Events
st: Diketsahalo

source: Everyone
st: Bohle

source: Exit & Delete clips
st: Tswa mme o Hlakole di-clip

source: Expert linguists can also help, try to reach out to local linguistic universities (both teachers and students) and see if they can help to gather a diverse set of sound-diverse sentences in your language.
st: Ditsebi tse hlwahlwa tsa dipuo le tsona di ka thusa, leka ho ikopanya le diunivesithi tsa lehae tsa botsebi ba dipuo bo hlwahlwa (bobedi matichere le baithuti) mme o bone na di ka thusa ho bokella mefuta-futa ya dipolelo tse nang le medumo e mefuta-futa puong ya hao.

source: Failed to delete selected sentences… Please try again!
st: E hlolehile ho hlakola dipolelo tse kgethilweng...Ka kopo leka hape!

source: Female
st: E motshehadi

source: Fields marked with an asterisk (*) are required.
st: Dibaka tse tshwauweng ka naledi (*) di a hlokahala.

source: Filtered sentences due to requirements failing (please submit fixed versions as new sentences):
st: Dipolelo tse siuweng ka lebaka la ditlhoko tse hlolehileng (ka kopo fana ka mefuta e tsitsitseng e le dipolelo tse ntjha):

source: Finding existing sentences in the Public Domain
st: Ho fumana dipolelo tse teng Setjhabeng

source: Find others who care. That could be universities, language schools, advocacy groups or data science communities. Reach out and explain clearly how they can help and why. <outreachTemplates>See our template outreach emails</outreachTemplates>.
st: Batla ba bang ba tsotellang. Bao e ka ba diunivesithi, dihlopha tsa babuelelli kapa dihlopha tsa mahlale a data. Ikopanye le bona mme o hlalose hantle na bona ba ka thusa jwang le hobaneng. <outreachTemplates>Sheba mehlala ya rona ho di-imeile tsa phihlello</outreachTemplates>.

source: Finish editing first?
st: Qetela ho lokisa pele?

source: Finish recording
st: Qetela ho rekota

source: Finish recording first?
st: Qetela ho rekota pele?

source: Finish Review
st: Qetela ho hlahloba
